INSERT INTO GENRE ("name")
VALUES 
('шансон'),
('рок'),
('фолк'),
('поп');

INSERT INTO ARTIST ("nickname")
VALUES 
('Михаил Круг'),
('Ария'),
('Сплин'),
('Руки вверх'),
('Анна Асти');

INSERT INTO ARTISTINGENRE ("artist_id", "genre_id")
VALUES (1,1), (2,2), (3,2), (4,4), (5,4);

INSERT INTO ALBUM ("name", "year")
VALUES 
('Гранатовый альбом', 1998),
('Новые люди', 2003),
('Феникс', 2022),
('Царица', 2025),
('Укради меня', 2020);

INSERT INTO ARTISTINALBUM ("artist_id", "album_id")
VALUES (3,1), (3,2), (5,3), (5,4), (4,5);
-- 

INSERT INTO TRACK ("name", "duration", "album_id")
VALUES 
('Весь этот бред', '3:07', 1),
('Достань гранату', '4:11', 1),
('Дурак', '3:25', 4),
('Царица', '3:35', 4),
('Феникс', '3:50', 3),
('По барам', '3:58', 3),
('Новые люди', '3:45', 2),
('Мой милый, прощай', '3:11', 4),
('Укради меня', '5:03', 5);

INSERT INTO COLLECTION ("name", "year")
VALUES 
('Рок хиты 2000-х', 2005),
('Хиты русского радио 2000-х', 2012),
('Поп музыка лучшее', 2024),
('Новогодний огонек 2020', 2020),
('Руки вверх лучшее', 2020);

INSERT INTO TRACKINCOLLECTION ("track_id", "collection_id")
VALUES (1,1), (2,1), (1,2), (3,3), (5,3), (7,1);
